<a href="https://colab.research.google.com/github/DWA-GIT/TESI-UNIFACISA/blob/master/Classificacao_4.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd

uri = "https://raw.githubusercontent.com/DWA-GIT/TESI-UNIFACISA/master/car-prices.csv"

dados = pd.read_csv(uri)

dados.head()

In [5]:
renomear = {
    'mileage_per_year' : 'milhas_por_ano',
    'model_year': "ano_modelo",
    'price' : "preco",
    'sold' : "vendido"  
    
}

dados = dados.rename(columns=renomear)
dados.head()

   Unnamed: 0  milhas_por_ano  ano_modelo      preco vendido
0           0           21801        2000   30941.02     yes
1           1            7843        1998   40557.96     yes
2           2            7109        2006   89627.50      no
3           3           26823        2015   95276.14      no
4           4            7935        2014  117384.68     yes